// 2. Задача
// Написать функцию, которая находит индекс первого имени в массиве, длина которого больше 5.

// ========================================================================= //

// 20. Задача
// Написать функцию, которая считает количество нечётных чисел в массиве.


// ========================================================================= //
// 23. Задача
// Написать функцию, которая возвращает наибольшее и наименьшее число из переданного массива. (функция возвращает объект с двумя свойствами)
// ========================================================================= //
// Дан массив объектов, выполнить следующие задачи:

// const users = [
//     {
//         id: 100,
//         name: "John",
//         age: 19,
//         isMarried: false,
//         scores: 78
//     },
//     {
//         id: 101,
//         name: "Peter",
//         age: 13,
//         isMarried: false,
//         scores: 311
//     },
//     {
//         id: 102,
//         name: "John",
//         age: 33,
//         isMarried: false,
//         scores: 0
//     },
//     {
//         id: 103,
//         name: "Alex",
//         age: 14,
//         isMarried: true,
//         scores: 121
//     },
//     {
//         id: 104,
//         name: "Lila",
//         age: 18,
//         isMarried: true,
//         scores: 999
//     },
// ]
// 44. Задача
// Написать функцию, которая принимает на вход массив, функция возвращает сумму всех очков у всех пользователей.
// ========================================================================= //
// ★ 51. Задача ★
//Написать функцию, которая принимает на вход массив, функция возвращает сумму всех очков у всех пользователей, которые женаты.
// ========================================================================= //
//★ 52. Задача ★
//Написать функцию, которая принимает на вход массив, функция возвращает сумму всех очков у всех совершеннолетних пользователей.

